# Задание 1

Дана переменная, в которой хранится слово из латинских букв. Напишите код, который выводит на экран:
* среднюю букву, если число букв в слове нечетное;
* две средних буквы, если число букв четное.


```python
latin_word = input('Введите слово латинскими буквами: ')
word_len  = len(latin_word)
```

    Введите слово латинскими буквами: test
    


```python
print('Результат:')
if word_len%2 != 0:
    print(latin_word[int((word_len-1)/2)])
else:
    print(latin_word[int((word_len/2)-1):int((word_len/2)+1)])
```

    Результат:
    es
    

# Задание 2

Напишите программу, которая последовательно запрашивает у пользователя числа (по одному за раз) и после первого нуля выводит сумму всех ранее введенных чисел.


```python
sumator = 0

in_number = int(input('Начните вводить числа: '))
while in_number != 0:
    sumator = sumator + in_number
    in_number = int(input())
print('Сумма чисел равна', sumator)
```

    Начните вводить числа: 0
    Сумма чисел равна 0
    

# Задание 3

Мы делаем MVP dating-сервиса, и у нас есть список парней и девушек.
Выдвигаем гипотезу: лучшие рекомендации мы получим, если просто отсортируем имена по алфавиту и познакомим людей с одинаковыми индексами после сортировки! Но мы не будем никого знакомить, если кто-то может остаться без пары:


```python
boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard']
girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']
```


```python
if len(boys) == len(girls):
    zip(boys, girls)
    print('Идеальные пары:')
    for i in range(len(boys)):
        print(sorted(boys)[i], ' и ', sorted(girls)[i])
else:
    print('Результат:\nВнимание, кто-то может остаться без пары!')
```

    Идеальные пары:
    Alex  и  Emma
    Arthur  и  Kate
    John  и  Kira
    Peter  и  Liza
    Richard  и  Trisha
    

# Задание 4

У нас есть список, содержащий информацию о среднедневной температуре в Фаренгейтах за произвольный период по странам (структура данных в примере). Необходимо написать код, который рассчитает среднюю температуру за период в Цельсиях(!) для каждой страны.


```python
countries_temperature = [
['Thailand', [75.2, 77, 78.8, 73.4, 68, 75.2, 77]],
['Germany', [57.2, 55.4, 59, 59, 53.6]],
['Russia', [35.6, 37.4, 39.2, 41, 42.8, 39.2, 35.6]],
['Poland', [50, 50, 53.6, 57.2, 55.4, 55.4]]
]
```


```python
# импортируем модуль с математическими и числовыми операциями
import numpy as np


print('Average day temperature in countries:')
# перебираем каждый список 2-го уровня и получаем из него второй элемент (список 3-го уровня) 
for country in countries_temperature:
    # вызываем функцию mean для расчета среднего значения;
    # без модуля можно было суммировать элементы списка и разделить их на количество элементов
    avg_temp = round((np.mean(country[1])-32)*(5/9),2)
    print(f"{country[0]} is {avg_temp} \xb0C")
```

    Average day temperature in countries:
    Thailand is 23.86 °C
    Germany is 13.8 °C
    Russia is 3.71 °C
    Poland is 12.0 °C
    

# Задание 5

Дан поток логов по количеству просмотренных страниц для каждого пользователя. Вам необходимо написать алгоритм, который считает среднее значение просмотров на пользователя. Т. е. надо посчитать отношение суммы всех просмотров к количеству уникальных пользователей.


```python
stream = [
'2018-01-01,user1,3',
'2018-01-07,user1,4',
'2018-03-29,user1,1',
'2018-04-04,user1,13',
'2018-01-05,user2,7',
'2018-06-14,user3,4',
'2018-07-02,user3,10',
'2018-03-21,user4,19',
'2018-03-22,user4,4',
'2018-04-22,user4,8',
'2018-05-03,user4,9',
'2018-05-11,user4,11',
]
```


```python
viewing = 0
customers = set()

for user_log in stream:
    viewing += int(user_log.split(',')[2])
    customers.add(user_log.split(',')[1])
print(f"Результат:\nСреднее количество просмотров на уникального пользователя: {round(viewing/len(list(customers)), 2)}")
```

    Результат:
    Среднее количество просмотров на уникального пользователя: 23.25
    


```python
stream = [
'2018-01-01,user100,150',
'2018-01-07,user99,205',
'2018-03-29,user1001,81'
]
```


```python
viewing = 0
customers = set()

for user_log in stream:
    viewing += int(user_log.split(',')[2])
    customers.add(user_log.split(',')[1])
print(f"Результат:\nСреднее количество просмотров на уникального пользователя: {round(viewing/len(list(customers)), 2)}")
```

    Результат:
    Среднее количество просмотров на уникального пользователя: 145.33
    

# Задание 6

Необходимо у пользователя запрашивать набор чисел разделенных пробелом. В результате должны выводиться числа, которые повторяются в вводе более одного раза.


```python
figures_list = []
unic_figures = set()

figures_list = input('Введите числа через пробел:\n').split(' ')
unic_figures.update(figures_list)
unic_figures.discard('')
print('Числа, которые встречаются более одного раза:')
for elements in unic_figures:
    if figures_list.count(elements) > 1:
        print(elements, end =' ')
```

    Введите числа через пробел:
    1 1 1 1 1 2 2 2
    Числа, которые встречаются более одного раза:
    1 2 


```python

```


```python

```


```python

```


```python

```


```python

```
